# [作業目標]

1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```


2. 一個包含兩個欄位的 DataFrame，將每個數字減去

```
* 1) 該欄位的平均數
* 2) 該筆資料平均數
```

3. 承上題，請問：

```
* 1) 哪一比的資料總合最小
* 2) 哪一欄位的資料總合最小
```

# 作業

### 1. 根據題目給的 DataFrame 完成下列操作：

```
- 計算每個不同種類 animal 的 age 的平均數
- 計算每個不同種類 animal 的 age 的平均數
- 將資料依照 Age 欄位由小到大排序，再依照 visits 欄位由大到小排序
- 將 priority 欄位中的 yes 和 no 字串，換成是布林值 的 True 和 False
```

In [18]:
# 記得先 Import 正確的套件

import pandas as pd
import numpy as np

In [19]:
data = {
    'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
    'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
    'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df = pd.DataFrame(data, index=labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [20]:
print(df.groupby('animal')['age'].mean())
print(df.sort_values(by=['age', 'visits'], ascending=[True, False]))
print(df.replace('yes', True).replace('no', False))

animal
cat      2.5
dog      5.0
snake    2.5
Name: age, dtype: float64
  animal  age  visits priority
c  snake  0.5       2       no
f    cat  2.0       3       no
a    cat  2.5       1      yes
b    cat  3.0       3      yes
j    dog  3.0       1       no
g  snake  4.5       1       no
e    dog  5.0       2       no
i    dog  7.0       2       no
d    dog  NaN       3      yes
h    cat  NaN       1      yes
  animal  age  visits  priority
a    cat  2.5       1      True
b    cat  3.0       3      True
c  snake  0.5       2     False
d    dog  NaN       3      True
e    dog  5.0       2     False
f    cat  2.0       3     False
g  snake  4.5       1     False
h    cat  NaN       1      True
i    dog  7.0       2     False
j    dog  3.0       1     False

### 2. 一個包含兩個欄位的 DataFrame，將每個數字減去

* 1) 該欄位的平均數
* 2) 該筆資料平均數

In [21]:
df = pd.DataFrame(np.random.random(size=(5, 3)))
df

          0         1         2
0  0.993175  0.101314  0.080196
1  0.667459  0.078951  0.931546
2  0.468693  0.231408  0.112212
3  0.105981  0.626369  0.634355
4  0.926042  0.870947  0.592684

In [22]:
df - df.mean()

          0         1         2
0  0.360905 -0.280484 -0.390002
1  0.035189 -0.302847  0.461347
2 -0.163578 -0.150390 -0.357987
3 -0.526289  0.244571  0.164156
4  0.293772  0.489149  0.122485

In [23]:
df.sub(df.mean(axis=1), axis=0)

          0         1         2
0  0.601613 -0.290248 -0.311366
1  0.108141 -0.480368  0.372227
2  0.197922 -0.039363 -0.158559
3 -0.349587  0.170801  0.178786
4  0.129485  0.074389 -0.203874

### 3. 承上題，請問：

1) 哪一比的資料總合最小
2) 哪一欄位的資料總合最小

In [24]:
df

          0         1         2
0  0.993175  0.101314  0.080196
1  0.667459  0.078951  0.931546
2  0.468693  0.231408  0.112212
3  0.105981  0.626369  0.634355
4  0.926042  0.870947  0.592684

In [25]:
df.sum(axis = 1).idxmin()

2

In [26]:
df.sum(axis = 1).idxmin()

2